const translations = {
    "ru": {
        "partners": "Работники",
        "aboutUs": "Про нас",
        "mainTitle": "Европейское агенство труда",
        "aboutUsLink": "Про нас",
        "newsLink": "Новости",
        "vacanciesLink": "Вакансии",
        "feedbackLink": "Обратная связь",
        "aboutTitle": "Про нас",
        "aboutSubtitle": "Група Haky на польском рынке трудоустройства более 8 лет, что показывает наработаный опыт и прозрачность нашей деятельности. За эти годы нас выбрали тысячи людей для работы в Польше. Наша команда состоит из профисионалов, знающих свое дело. С нами работают и нам доверяют более 1000 сотрудников по всей Польше. Наши партнеры это большые польские и мировые компании: Biedronka, Netto, Stokrotka, Helio, HOPI, Eurocash, Cellfast, MFO, Bakoma.",
        "aboutButton": "Больше информации об услугах",
        "newsTitle": "Новости",
        "vacanciesTitle": "Вакансии",
        "itemTitle": "Работа заключается в:Комплектации товаров",
        "itemSubTitleOne": "Расположение: Тересин",
        "itemSubTitleTwo": "Расположение: Краков, Старгард",
        "itemSubTitleThree": "Расположение: Мщонув , Вышкув, Коштын , Гданск",
        "itemSubTitleFour": "Расположение: Тересин , Кобылянка , Вроцлав , Гливице",
        "itemDescription": "Чем ты будешь заниматься? Компелктация товаров, сбор заказов на супермаркеты с помощью сканера и электрического узика. Работа в двух отделах склада: теплый и холодный. Температура в теплом +18-20С, в холодном +8-10С. (Нужно иметь более теплые вещи с собой).",
        "itemInfoOne": "Что мы хотим вам предложить? Заработная плата зависит от количества и скорости сделанных заказов. Доплата работникам до 26 лет + 1зл/ч Графики труда: с НД в ПТ по 10-12 часов в зависимости от количества заказов. На каждом объекте около 240–320 часов в месяц. (Об актуальном количестве часов на каждом объекте прошу уточнять) Требования к кандидату: ребята, девушки, семейные пары до 35 лет. Визы, биометрия (не менее 2-х месяцев), карты обихода. Жилье предоставляется бесплатно, снимается только за коммунальные услуги 200 зл в месяц. Семейные пары живут отдельно, но возможно проживание 2 пары в одной комнате. В комнатах 3-5 человек. Доезд к работе организованный, 100 зл/месяц Одежда: Обувь с металлическими накладками (защитные), специальные брюки и каска высчитывается из первой зп (около 130-150 зл)",
        "itemInfoTwo": "Что мы хотим вам предложить? От 13,40 зл/ч до 27 зл/час (аккордовая система). Заработная плата зависит от количества и скорости сделанных заказов. Краков (приложение за ночные +2,65зл/час) Старгард (премии за хорошую производительность от 100 до 300 зл, за переработку более 12 часов приложение 150зл) Сосновец (приложение за ночные +2,65зл/час) Белосток 2,65зл/час) Доплата работникам до 26 лет + 1зл/час Графики труда: с НД до ПТ по 8-12 часов в зависимости от количества заказов (Об актуальном количестве часов на каждом объекте прошу уточнять) Требования к кандидату: ребята , семейные пары до 35 лет Визы, биометрия (не менее 2-х месяцев), карты обихода. Жилье предоставляется бесплатно, снимается только за коммунальные услуги 200 зл в месяц. Семейные пары живут отдельно, но возможно проживание 2 пары в одной комнате. В комнатах 3-5 человек. Доезд к работе организованный, 100 зл/месяц Одежда: Обувь с металлическими накладками (защитные), каска вычисляется из первой и п (около 130-150 зл)",
        "itemInfoThree": "Что мы хотим вам предложить? Для девочек разделен труд только на отделе химии и молочке, где более легкие товары. От 13,80-14,80 зл/ч до 35 зл/час (аккордовая система). Заработная плата зависит от количества и скорости сделанных заказов. Доплата работникам до 26 лет + 1зл/ч. Премия лучшему работнику 200зл. Также, если в пересчете в час, работник получает больше 25 зл/ч, будет дополнительно +1 зл/час. Графики труда: с НД до ПТ по 8-12 часов в зависимости от количества заказов. На каждом объекте около 200 часов в месяц. (Об актуальном количестве часов на каждом объекте прошу уточнять) Требования к кандидату: ребята, семейные пары до 35 лет. За девушек прошу учтенить. Визы, биометрия (не менее 2-х месяцев), карты обихода. Жилье предоставляется бесплатно, снимается только за коммунальные услуги 200 зл в месяц. Семейные пары живут отдельно, но возможно проживание 2 пары в одной комнате. В комнатах 3-5 человек. Доезд к работе организованный, 100 зл/месяц Одежда: Обувь с металлическими накладками (защитные), специальные брюки и каска высчитывается из первой зп (около 130-150 зл)",
        "itemInfoFour": "Что мы хотим вам предложить? От 13,50 зл/ч до 26 зл/час (аккордовая система). Заработная плата зависит от количества и скорости сделанных заказов. Доплата работникам до 26 лет + 1зл/ч. Премия лучшему работнику 200зл. Графики труда: с НД до ПТ по 8-12 часов в зависимости от количества заказов. На каждом объекте около 200 часов в месяц. (Об актуальном количестве часов на каждом объекте прошу уточнять) Требования к кандидату: ребята, семейные пары до 35 лет. За девушек прошу учтенить. Визы, биометрия (не менее 2-х месяцев), карты обихода. Жилье предоставляется бесплатно, снимается только за коммунальные услуги 200 зл в месяц. Семейные пары живут отдельно, но возможно проживание 2 пары в одной комнате. В комнатах 3-5 человек. Доезд к работе организованный, 100 зл/месяц Одежда: Обувь с металлическими накладками (защитные), специальные брюки и каска высчитывается из первой зп (около 130-150 зл)",
        "itemText": "Тебе меньше 26? Согласно правилам, ваш доход освобождается от налогообложения, так называемого 0. Звучит хорошо? Не ждите-свяжитесь с нами сегодня!",
        "feedbackTitle": "Мы вам перезвоним",
        "positionOne": "Работа на складе",
        "positionTwo": "Рaбота за заводе металлургических конструкций",
        "positionThree": "Работа на заводе молочных изделий",
        "positionFour": "Работа на складе",
        "positionOneSubtitle": "Город Сосновец( 20 км от Катовиц)",
        "positionOneDescription": "Мужчины, женщины, семейные пары до 35 лет, виза от 3 месяцев, полное био! Жилье бесплатное (оплата только за коммунальные услуги), отдельные комнаты для пар, хорошие условия, организованный доезд на работу! Вакансии: - комплектация товаров,оплата аккордная от 15,5 до 22 злотых/ч нетто - оператор тележки высокого склада с UDT (оплата аккордная от 14,6 до 22 зл/час) Изменения по 10-12 часов Доплата лицам до 26 лет! По деталям +380967025050 вайбер +48721230896",
        "positionTwoSubtitle": "Город Блоне (Возле Варшавы)",
        "positionTwoDescription":"Мужчины, женщины, семейные пары до 35 лет, виза от 3 месяцев, полное био! комплектация товара на магазин (оплата аккордная от 17,00 до 25,50 zl/час нетто) от скорости исполнения заказов + 1 зл/час. лицам до 26 лет)Изменения по 8-12 часов.Доплата за ночные часы 2,8 зл. Бесплатное жилье (оплата только за коммунальные услуги), отдельные комнаты для пар, хорошие условия! Организованный доезд в город работы! По деталям +380967025050 Вайбер +48721230896",
        "positionThreeSubtitle":"Город Сохачев, рядом с Варшавой",
        "positionThreeDescription":"Мужчины до 45 лет! Работа на станках по резке металла. Виза от 3 меяцов, полное био! Оплата почасовая 15,75 зл/час. Изменения по 8-12 часов. Бесплатное жилье (оплата только за коммунальные услуги), хорошие условия! По деталям +380967025050 вайбер +48721230896",
        "positionFourSubtitle":"Город Сохачев, рядом с Варшавой",
        "positionFourDescription":"Мужчины, женщины, семейные пары до 50 лет, виза от 3 месяцев, полное био! -Комплектация, миксование молочных изделий Оплата почасовая: -до 8 рабочих часов по 14,90 zl/ч нетто, -от 8 до 10 рабочих часов по 22,47 zl/ч нетто, -от 10 до 12 рабочих часов по 29,96 zl/ч нетто, Доплата за ночные часы! Изменения по 8-12 часов. Бесплатное жилье (оплата только за коммунальные услуги), отдельные комнаты для пар, хорошие условия! Организованный доезд в город работы! По деталям +380967025050 вайбер +48721230896",
        "positionFive":"Город Гливице (20 км от Катовице) Город Тересин (40 км от Варшавы)",
        "positionFiveDescription":"Мужчины, женщины, семейные пары до 35 лет, виза от 3 месяцев, полное био! Бесплатное жилье (оплата только за коммунальные услуги), отдельные комнаты для пар, хорошие условия! Вакансии: - комплектация товаров (оплата аккордная от 14,6 до 26zl/час. нетто, зависит от скорости исполнения заказов.) - загрузка прицепов (ставка 18 зл/час. нетто) - оператор тележки высокого склада с UDT (ставка 18 зл/ ч. нетто) Изменения по 8-12 часов Доплата лицам до 26 лет! По деталям +380967025050 вайбер +48721230896",
        "moreVacansiesButton":"Больше Вакансий"
    },
    "ua": {
        "partners": "Працівники",
        "aboutUs": "Про нас",
        "mainTitle": "Європейська агенція праці",
        "aboutUsLink": "Про нас",
        "newsLink": "Новини",
        "vacanciesLink": "Вакансії",
        "feedbackLink": "Зворотній зв'язок",
        "aboutTitle": "Про нас",
        "aboutSubtitle": "Група Haky на польському ринку працевлаштування понад 8 років, що показує напрацьований досвід та прозорість нашої діяльності. За ці роки нас обрали тисячі людей для роботи у Польщі. Наша команда складається з професіоналів, які знають свою справу. З нами працюють і нам довіряють понад 1000 співробітників у всій Польщі. Наші партнери це великі польські та світові компанії: Biedronka, Netto, Stokrotka, Helio, HOPI,Eurocash, Cellfast, MFO, Bakoma.",
        "aboutButton": "Більше інформації про послуги",
        "newsTitle": "Новини",
        "vacanciesTitle": "Вакансії",
        "itemTitle": "Робота полягає в:Комплектації товару",
        "itemSubTitleOne": "Расположение: Тересін",
        "itemSubTitleTwo": "Расположение: Краков,Старгард",
        "itemSubTitleThree": "Расположение: Мщонув , Вишкув, Коштин , Гданьск",
        "itemSubTitleFour": "Расположение: Тересін , Кобилянка , Вроцлав, Глівіце",
        "itemDescription": "Чим ти будеш займатися? Компелктація товарів, збір замовлень на супермаркети з-за допомогою сканера і вузика електричного. Робота на двох відділах складу: теплий і холодний. Температура у теплому +18-20С, у холодному +8-10С. (Потрібно мати тепліші речі з собою).",
        "itemInfoOne": "Що ми хочемо вам запропонувати? Заробітня плата залежить від кількості і швидкості зроблених замовлень. Доплата працівникам до 26 років + 1зл/год Графіки праці: з НД до ПТ по 10-12 год в залежності від кількості замовлень. На кожному обєкті около 240-320 годин в місяць. (Про актуальну кількість годин на кожному обєкті прошу уточняти) Вимоги до кандидату: хлопці, дівчата, сімейні пари до 35 років. Візи, біометрія (не меньше 2-ох місяців), карти побуту. Проживання: житло надається безкоштовно, знімається тільки за комунальні послуги 200зл в місяць. Сімейні пари живуть окремо, але можливо проживання 2 пари в одній кімнаті. В кімнатах 3-5 осіб. Доізд до роботи організований, 100 зл/місяць Одяг: Взуття з металевими накладками (захисні), спеціальні штани і каска вираховується з першоі зп (около 130-150 зл)",
        "itemInfoTwo": "Що ми хочемо вам запропонувати? Від 13,40 зл/год до 27 зл/год (аккордова система). Заробітня плата залежить від кількості і швидкості зроблених замовлень. Краків (додаток за нічні +2,65зл/год) Старгард (преміі за хорошу продуктивність від 100 до 300 зл, за перероблення більше 12 годин додаток 150зл) Сосновець (додаток за нічні +2,65зл/год) Білосток (додаток за нічні +2,65зл/год) Доплата працівникам до 26 років + 1зл/год Графіки праці: з НД до ПТ по 8-12 год в залежності від кількості замовлень (Про актуальну кількість годин на кожному обєкті прошу уточняти) Вимоги до кандидату: хлопці, дівчата, сімейні пари до 35 років. Візи, біометрія (не меньше 2-ох місяців), карти побуту. Проживання: житло надається безкоштовно, знімається тільки за комунальні послуги 200зл в місяць. Сімейні пари живуть окремо, але можливо проживання 2 пари в одній кімнаті. В кімнатах 3-5 осіб. Доізд до роботи організований, 100 зл/місяць Одяг: Взуття з металевими накладками (захисні), каска вираховується з першоі зп (около 130-150 зл)",
        "itemInfoThree": "Що ми хочемо вам запропонувати? Для дівчат поділенна праця тільки на відділі хіміі і молочці, де більш легші товари. Від 13,80-14,80 зл/год до 35 зл/год (аккордова система). Заробітня плата залежить від кількості і швидкості зроблених замовлень. Доплата працівникам до 26 років + 1зл/год Премія найкращому працівнику 200зл. Також, якщо в перерахунку на годину, працівник отримує більше 25зл/год, матиме додатково +1 зл/год. Графіки праці: з НД до ПТ по 8-12 год в залежності від кількості замовлень. На кожному обєкті около 200 годин в місяць. (Про актуальну кількість годин на кожному обєкті прошу уточняти) Вимоги до кандидату: хлопці, сімейні пари до 35 років. За дівчат прошу учтоняти. Візи, біометрія (не меньше 2-ох місяців), карти побуту. Проживання: житло надається безкоштовно, знімається тільки за комунальні послуги 200зл в місяць. Сімейні пари живуть окремо, але можливо проживання 2 пари в одній кімнаті. В кімнатах 3-5 осіб. Доізд до роботи організований, 100 зл/місяць Одяг: Взуття з металевими накладками (захисні), спеціальні штани і каска вираховується з першоі зп (около 130-150 зл)",
        "itemInfoFour": "Що ми хочемо вам запропонувати? Від 13,50 зл/год до 26 зл/год (аккордова система). Заробітня плата залежить від кількості і швидкості зроблених замовлень. Доплата працівникам до 26 років + 1зл/год Премія найкращому працівнику 200зл. Графіки праці: з НД до ПТ по 8-12 год в залежності від кількості замовлень. На кожному обєкті около 200 годин в місяць. (Про актуальну кількість годин на кожному обєкті прошу уточняти) Вимоги до кандидату: хлопці, сімейні пари до 35 років. За дівчат прошу учтоняти. Візи, біометрія (не меньше 2-ох місяців), карти побуту. Проживання: житло надається безкоштовно, знімається тільки за комунальні послуги 200зл в місяць. Сімейні пари живуть окремо, але можливо проживання 2 пари в одній кімнаті. В кімнатах 3-5 осіб. Доізд до роботи організований, 100 зл/місяць Одяг: Взуття з металевими накладками (захисні), спеціальні штани і каска вираховується з першоі зп (около 130-150 зл)",
        "itemText": "Тобі менше 26? Згідно з правилами, ваш дохід звільняється від оподаткування, так званого 0 Звучить добре? Не чекайте-зв'яжіться з нами сьогодні!",
        "feedbackTitle": "Ми вам передзвонимо",
        "positionOne": "Робота на складі",
        "positionTwo": "Робота за заводі металевих констркцій",
        "positionThree": "Робота за заводі молочних виробів",
        "positionFour": "Робота на складі",
        "positionOneSubtitle": "Місто Сосновець( 20 км від Катовіц)",
        "positionOneDescription": "Чоловіки, жінки, сімейні пари до 35 років, віза від 3 місяців, повне біо! Житло безкоштовне (оплата лише за комунальні послуги), окремі кімнати для пар, хороші умови, організований доїзд до роботи! Вакансії: - комплектація товарів,оплата акордна від 15,5 до 22 злот/год нетто - оператор візка високого складу з UDT (оплата акордна від 14,6 до 22 зл/год) Зміни по 10-12годин Доплата особам до 26 років! За деталями + 380967025050 вайбер + 48721230896",
        "positionTwoSubtitle": "Місто Блоне (біля Варшави)",
        "positionTwoDescription": "Чоловіки, жінки, сімейні пари до 35 років, віза від 3 місяців, повне біо!комплектація товару на магазин(оплата акордна від 17,00 до 25,50 zl/ год нетто, залежитьвід швидкості виконань замовлень + 1 зл/год. особам до 26 років)Зміни по 8 - 12 год. Доплата за нічні години 2, 8 zl.Безкоштовне житло(оплата лише за комунальні послуги), окремі кімнати для пар, хороші умови! Організований доїзд до містя роботи! За деталями + 380967025050 вайбер + 48721230896",
        "positionThreeSubtitle":"місто Сохачев, біля Варшави",
        "positionThreeDescription":"Чоловіки до 45 років! Робота на станках по різці металу. Віза від 3 міяців, повне біо! Оплата погодинова 15,75 зл/год. Зміни по 8-12 год. Безкоштовне житло(оплата лише за комунальні послуги), хороші умови! За деталями +380967025050 вайбер +48721230896",
        "positionFourSubtitle":"Місто Сохачев, біля Варшави",
        "positionFourDescription":"Чоловіки, жінки, сімейні пари до 50 років, віза від 3 місяців, повне біо! -Комплектація, міксування молочних виробів Оплата погодинова: -до 8 робочих годин по 14,90 zl/год нетто, -від 8 до 10 робочих годин по 22,47 zl/год нетто, -від 10 до 12 робочих годин по 29,96 zl/год нетто, Доплата за нічні години! Зміни по 8-12 год. Безкоштовне житло(оплата лише за комунальні послуги), окремі кімнати для пар, хороші умови! Організований доїзд до містя роботи! За деталями +380967025050 вайбер +48721230896",
        "positionFive":"Місто Гливиці (20 км від Катовіце) Місто Тересін (40 км від Варшави)",
        "positionFiveDescription":"Чоловіки, жінки, сімейні пари до 35 років, віза від 3 місяців, повне біо! Безкоштовне житло (оплата лише за комунальні послуги),окремі кімнати для пар, хороші умови! Вакансії: - комплектація товарів (оплата акордна від 14,6 до 26zl/год. нетто, залежить від швидкості виконань замовлень.) - завантаження причепів (ставка 18 зл/год. нетто) - оператор візка високого складу з UDT (ставка 18 зл/год. нетто) Зміни по 8-12годин Доплата особам до 26 років! За деталями +380967025050 вайбер +48721230896",
        "moreVacansiesButton":"Більше вакансій"

    }

};

$(document).ready(function () {
    const availableLang = ['pl', 'ru', 'ua'];

    // get select from DOM
    const select = $('.change_lang');

    // getting current lang from url
    let hash = window.location.hash;
    hash = hash.substring(1);

    // checking if lang is in available list
    if (availableLang.includes(hash)) {
        select.val(hash);
        applyLanguage(hash);
    } else {
        // default language
        select.val('ua');
    }

    // set listener
    select.change(function () {
        cnangeURLLanguage();
    });

    function cnangeURLLanguage() {
        let lang = select.val(); // get select value
        location.href = window.location.pathname + '#' + lang; // set new url with selected language
        applyLanguage(lang);
    }

    function applyLanguage(lang) {
        $('.menu_subtitle').text(translations[lang].partners),
            $('.main_subtitle').text(translations[lang].mainTitle),
            $('#aboutUs').text(translations[lang].aboutUsLink),
            $('#news').text(translations[lang].newsLink),
            $('#vacancies').text(translations[lang].vacanciesLink),
            $('#feedback').text(translations[lang].feedbackLink),
            $('.about_title').text(translations[lang].aboutTitle),
            $('.about_subtitle').text(translations[lang].aboutSubtitle),
            $('.about_wrapper-button').text(translations[lang].aboutButton),
            $('.news_title').text(translations[lang].newsTitle),
            $('.vacancies_title').text(translations[lang].vacanciesTitle),
            $('.vacancies_wrapper-item--title').text(translations[lang].itemTitle),
            $('#itemSubTitleOne').text(translations[lang].itemSubTitleOne),
            $('#itemSubTitleTwo').text(translations[lang].itemSubTitleTwo),
            $('#itemSubTitleThree').text(translations[lang].itemSubTitleThree),
            $('#itemSubTitleFour').text(translations[lang].itemSubTitleFour),
            $('.vacancies_wrapper-item--description').text(translations[lang].itemDescription),
            $('#vacansiesItemOne').text(translations[lang].itemInfoOne),
            $('#vacansiesItemTwo').text(translations[lang].itemInfoTwo),
            $('#vacansiesItemThree').text(translations[lang].itemInfoThree),
            $('#vacansiesItemFour').text(translations[lang].itemInfoFour),
            $('.vacancies_wrapper-item--text').text(translations[lang].itemText),
            $('.feedback_wrapper-title').text(translations[lang].feedbackTitle),
            $('#positionOne').text(translations[lang].positionOne),
            $('#positionTwo').text(translations[lang].positionTwo),
            $('#positionThree').text(translations[lang].positionThree),
            $('#positionFour').text(translations[lang].positionFour),
            $('#positionOneSubtitle').text(translations[lang].positionOneSubtitle),
            $('#positionOneDescription').text(translations[lang].positionOneDescription),
            $('#positionTwoSubtitle').text(translations[lang].positionTwoSubtitle),
            $('#positionTwoDescription').text(translations[lang].positionTwoDescription),
            $('#positionThreeSubtitle').text(translations[lang].positionThreeSubtitle),
            $('#positionThreeDescription').text(translations[lang].positionThreeDescription),
            $('#positionFourSubtitle').text(translations[lang].positionFourSubtitle),
            $('#positionFourDescription').text(translations[lang].positionFourDescription),
            $('#positionFive').text(translations[lang].positionFive),
            $('#positionFiveDescription').text(translations[lang].positionFiveDescription),
            $('#moreVacansiesButton').text(translations[lang].moreVacansiesButton)

    }
});

// $(document).click(function(event) {
//     if ($(window).width() <= 992) {
//         const isMenu = $(event.target).is(".menu");
//         const isMenuButton = $(event.target).is('.mobile_button');
//         const isMenuHidden = $('.menu').is(":hidden");
//         if (!isMenu && !isMenuButton && !isMenuHidden) {
//             $(".menu").removeClass('slide');
//         }
//     };
// });


